Revit 2024 API
MasonryCMU.MasonryCMUPattern Property
 The property labeled "Relief Pattern" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MasonryCMUPattern { get; }
Visual Basic
Public Shared ReadOnly Property MasonryCMUPattern As String
	Get
Visual C++
public:
static property String^ MasonryCMUPattern {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".
See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace